share/tutorials/incompressible/piso/les/pitz_daily_mapped/0/U
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
  inlet
  {
    type                mapped;
    value               uniform (10 0 0);
    interpolationScheme cell;
    setAverage          true;
    average             (10 0 0);
  }
  outlet
  {
    type                inletOutlet;
    inletValue          uniform (0 0 0);
    value               uniform (0 0 0);
  }
  upperWall
  {
    type                fixedValue;
    value               uniform (0 0 0);
  }
  lowerWall
  {
    type                fixedValue;
    value               uniform (0 0 0);
  }
  frontAndBack
  {
    type                empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
