share/tutorials/incompressible/piso/les/pitz_daily_mapped/system/decomposeParDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      decomposeParDict;
}

numberOfSubdomains 8;
method          scotch;
simpleCoeffs
{
  n               (2 1 1);
  delta           0.001;
}
hierarchicalCoeffs
{
  n               (2 1 1);
  delta           0.001;
  order           xyz;
}
manualCoeffs
{
  dataFile        "";
}
distributed     no;
roots           ( );

// vim: set ft=foam et sw=2 ts=2 sts=2:
